package god08;
//在一个类上使用abstract 抽象类：接口
public abstract class Action {
    //约束~有人帮我们实现
    //abstract,抽象方法，只有方法名字，没有方法实现！
    //相当于我不写方法，没有{},
    public abstract void dosomething();
}
//1.不能new这个抽象类，只能靠子类去实现，所以会用到继承，不过可以去new它的子类对象
//2.抽象类中可以写普通方法
//3.抽象方法必须在抽象类中
//抽象的抽象：约束
//思考：new，存在构造器么？以及抽象类存在的意义
//答：抽象类里面存在构造方法，但是不能只能new抽象类
abstract class Animal{
    public Animal(){
        System.out.println("付抽象类的构造执行");
    }
    public abstract void shout();
}
//不能new，为什么还要构造器，因为要供子类的构造器，默认调用super()，当子类new的时候，会先跑到抽象父类的构造去执行，构造方法不能加abstract
//意义：抽象类不能实例化，就是用来做父类，专门提取供所有子类的公共模板(公共属性，通用方法，定义必须实现的抽象方法)，用来约束子类，实现代码复用和规范
//没有方法体的抽象方法，强制所有子类必须去重写实现这个方法。
//抽象类：有构造，不自new，留给子类去调用，做模板，定规矩，不过还是接口用得比较多